Revit 2027 API
Space.BaseHeatLoadOn Property
The heat load-on.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BaseLoadOn BaseHeatLoadOn { get; set; }
Public Property BaseHeatLoadOn As BaseLoadOn
	Get
	Set
public:
property BaseLoadOn BaseHeatLoadOn {
	BaseLoadOn get ();
	void set (BaseLoadOn value);
}
member BaseHeatLoadOn : BaseLoadOn with get, set
Property Value
BaseLoadOn
Exceptions
Exception | Condition
ArgumentException |  Thrown when the values is not kUseDefaultLoad or kUseEnteredLoad.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace